Revit 2026 API

# GeometryCreationUtilitiesCreateExtrusionGeometry(IListCurveLoop, XYZ, Double, SolidOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Solid CreateExtrusionGeometry(
	IList<CurveLoop> profileLoops,
	XYZ extrusionDir,
	double extrusionDist,
	SolidOptions solidOptions
)
```
```vb
Public Shared Function CreateExtrusionGeometry (
	profileLoops As IList(Of CurveLoop),
	extrusionDir As XYZ,
	extrusionDist As Double,
	solidOptions As SolidOptions
) As Solid
```
```cpp
public:
static Solid^ CreateExtrusionGeometry(
	IList<CurveLoop^>^ profileLoops,
	XYZ^ extrusionDir,
	double extrusionDist,
	SolidOptions^ solidOptions
)
```
```fsharp
static member CreateExtrusionGeometry :
        profileLoops : IList<CurveLoop> *
        extrusionDir : XYZ *
        extrusionDist : float *
        solidOptions : SolidOptions -> Solid
```

#### Parameters

profileLoops IListCurveLoop

extrusionDir XYZ

extrusionDist Double

solidOptions SolidOptions

#### Return Value

Solid

#### Reference

GeometryCreationUtilities Class

CreateExtrusionGeometry Overload

Autodesk.Revit.DB Namespace